package com.example.Spring_Boot_Data_Jpa_ER_H2_Rest.exception;

import java.io.Serial;

public class ResourceException extends RuntimeException {

    // В Java, serialVersionUID є унікальним ідентифікатором
    // серіалізованого класу. Це поле, яке розробники можуть
    // явно оголосити в класі, щоб контролювати версії під час
    // серіалізації та десеріалізації. Коли об’єкт серіалізовано,
    // serialVersionUID також записується в потік байтів разом
    // із даними об’єкта.
    // Основна мета serialVersionUID — забезпечити сумісність
    // серіалізованої форми класу між різними версіями цього класу.
    // Це допомагає виявити несумісні зміни, внесені до класу, які
    // перешкоджають успішній десеріалізації попередньо серіалізованих
    // об’єктів.
    // Коли клас серіалізовано, його serialVersionUID включається в
    // серіалізовану форму. Під час десеріалізації JVM перевіряє,
    // чи збігається serialVersionUID серіалізованого об’єкта з
    // serialVersionUID визначення класу. Якщо вони не збігаються,
    // виникає виняткова ситуація InvalidClassException, яка вказує
    // на проблему сумісності. Цей механізм запобігає десеріалізації
    // об’єктів, які можуть бути несумісними через зміни класу.
    @Serial
    private static final long serialVersionUID = 1L;

    public ResourceException(String msg) {
        super(msg);
    }
}
